LiquidBridgeStretching/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "getProperties"
mergeType points;   // Wedge geometry - Merge points instead of topology

//scale   0.001;

vertices
(
    (0 0 0) //0
    ($X1 $Y1 0) //1
    ($X $Y 0) //2
    ($X -$Y 0) //3
    ($X1 -$Y1 0) //4
    (0 0 $Z) //5    
    ($X1 $Y1 $Z) //6
    ($X $Y $Z) //7 
    ($X -$Y $Z) //8  
    ($X1 -$Y1 $Z) //9
);

blocks
(
    hex (0 1 6 5 0 4 9 5) ($nx $nz $ny) simpleGrading (1 1 1)
    hex (1 2 7 6 4 3 8 9) ($nx2 $nz $ny) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 5 5 0)
        );
    }
    right
    {
        type patch;
        faces
        (
            (3 8 7 2)
        );
    }
    back
    {
        type wedge;
	faces
	(
		(0 5 9 4)
		(9 8 3 4)
	);
    }
    front
    {
        type wedge;
	faces
	(
		(0 1 6 5)
		(1 2 7 6)
	);
    }
    top
    {
        type wall;
        faces
        (
            (5 6 9 5)
	    (6 7 8 9)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 4 1 0)
	    (1 4 3 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
