LiquidBridgeStretching/case/system/getProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      getProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

a	150;
H0	0.00106; // height of the liquid bridge
V	5e-9;
pi	pi();
R0      #eval { sqrt(($V/($pi*$H0)) + sqr($pi*$H0/8.0)) + ($pi*$H0/8.0) };

X  	#eval {$R0*6}; // domain total width
X1      #eval {$R0*1.5}; // refined domain (liquid bridge side) rest is coarse
Z  	#eval {$H0*25}; // domain total height
Y  	0.01e-3;
Y1      #eval {($Y-0)/($X-0)*$X1};
Z1 	#eval {$Z-$H0}; // lower end of the liquid bridge

nz      #eval {round($Z/($H0/30))}; //10 cells per height H0
nx      #eval {round($X1/($Z/$nz))};
nx2     #eval {round($nx/3.5)};
ny	1;
// ************************************************************************* //
